espressif/esp-idf/components/driver/test_apps/legacy_adc_driver/sdkconfig.ci.esp32c2_xtal26m_release
CONFIG_IDF_TARGET="esp32c2"
CONFIG_XTAL_FREQ_26=y

CONFIG_PM_ENABLE=y
CONFIG_FREERTOS_USE_TICKLESS_IDLE=y
CONFIG_COMPILER_OPTIMIZATION_SIZE=y
CONFIG_BOOTLOADER_COMPILER_OPTIMIZATION_SIZE=y
CONFIG_COMPILER_OPTIMIZATION_ASSERTIONS_SILENT=y
